package main

import "fmt"

func main() {
	arr1 := [5]int{1, 10, 100, 1000, 10000}
	arr2 := arr1 // arr2 배열에 arr1 복사

	fmt.Println("ex1 : ", arr1, arr1, &arr1)
	fmt.Println("ex1 : ", arr2, arr2, &arr2)

	fmt.Printf("ex1: %p , %v\n", &arr1, arr1)
	fmt.Printf("ex1: %p , %v\n", &arr2, arr2)
	/*
		결과 :
		ex1 :  [1 10 100 1000 10000] [1 10 100 1000 10000] &[1 10 100 1000 10000]
		ex1 :  [1 10 100 1000 10000] [1 10 100 1000 10000] &[1 10 100 1000 10000]
		ex1: 0xc000012630 , [1 10 100 1000 10000]
		ex1: 0xc000012660 , [1 10 100 1000 10000]

		주소값은 다르지만 , 값은 동일한것을 볼 수 있습니다.

		따라서 값을 복사했습니다.

		배열은 값을 참조하기에 값만 복사합니다.
	*/
}
